/* ==================
 脚本类型: NPC	    
 脚本版权：游戏盒团队
 联系扣扣：297870163    609654666
 =====================
 */
var status = 0;
var beauty = 0;
var price = 1000000;
var mface = Array(23010, 23020, 23027, 23033, 23034, 23053, 23054, 23057, 23059, 23060, 23061, 23063, 23064, 23086, 23079, 23077, 23078, 23081, 23084, 23086, 20000, 20001, 20002, 20003, 20004, 20005, 20006, 20007, 20008, 20009, 20010, 20011, 20012, 20013, 20014, 20015, 20016, 20017, 20018, 20019, 20020, 20021, 20022, 20023, 20024, 20025, 20026, 20027, 20028, 20030, 20031, 20032, 20033, 20035, 20036, 20037, 20038, 20040, 20043, 20044, 20045, 20046, 20047, 20048, 20049, 20050, 20051, 20052, 20053, 20054, 20055, 20056, 20057, 20058, 20059, 20100, 20101, 20102, 20103, 20104, 20105, 20106, 20107, 20108, 20109, 20110, 20111, 20112, 20113, 20114, 20115, 20116);
var fface = Array(21091, 21092, 24001, 24008, 24016, 24022, 24027, 24036, 24052, 24057, 24058, 24061, 24077, 24079, 24088, 21000, 21001, 21002, 21003, 21004, 21005, 21006, 21007, 21008, 21009, 21010, 21011, 21012, 21013, 21014, 21015, 21016, 21017, 21018, 21019, 21020, 21021, 21022, 21023, 21025, 21026, 21028, 21031, 21033, 21034, 21035, 21036, 21041, 21042, 21044, 21045, 21046, 21047, 21048, 21049, 21050, 21052, 21055, 21056, 21057, 21100, 21101, 21102, 21103, 21104, 21105, 21106, 21107, 21108, 21109, 21111, 21112, 21113, 21114, 21115, 21116, 21117, 21118, 21119, 21120, 21121, 21122, 21123, 21125, 21126);
var facenew = Array();

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (mode == 0 && status == 0) {
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;
        if (status == 0) {
            cm.sendSimple("我是黛玛院长.如果你有#b#t5152001##k任何机会.那么怎么样让我帮整形?\r\n\#L2#使用#b#t5152001##k");
        } else if (status == 1) {
            if (selection == 1) {
                if(cm.getMeso() >= price) {
                    cm.gainMeso(-price);
                    cm.gainItem(5152001, 1);
                    cm.sendOk("尽情的享受你的新造型吧!");
                } else
                    cm.sendOk("你没有足够的资本来购买优惠券!");
                cm.dispose();
            } else if (selection == 2) {
                facenew = Array();
                if (cm.getPlayer().getGender() == 0) {
                    for(var i = 0; i < mface.length; i++)
                        facenew.push(mface[i] + cm.getPlayer().getFace()% 1000 - (cm.getPlayer().getFace()% 100));
                }
                if (cm.getPlayer().getGender() == 1) {
                    for(var i = 0; i < fface.length; i++)
                        facenew.push(fface[i] + cm.getPlayer().getFace()% 1000 - (cm.getPlayer().getFace()% 100));
                }
                cm.sendStyle("请选择一个你喜欢的",facenew);
            }
        }
        else if (status == 2){
            cm.dispose();
            if (cm.haveItem(5152001) == true){
                cm.gainItem(5152001, -1);
                cm.setFace(facenew[selection]);
                cm.sendOk("尽情的享受你的新造型吧!!");
            } else
                cm.sendOk("您貌似没有#b#t5152001##k..");
        }
    }
}
