importPackage(java.lang);
importPackage(Packages.client);
importPackage(Packages.client.inventory);
importPackage(Packages.server);
importPackage(Packages.constants);
importPackage(Packages.net.channel);
importPackage(Packages.tools);
importPackage(Packages.scripting);
importPackage(Packages.tools.packet);
importPackage(Packages.tools.data);
importPackage(Packages.tools);
var status = 0;
var itemList =   
Array(   

Array(1402063, 50, 1, 1), //樱花伞
Array(1382016, 100, 1, 1), //香菇 ——--高级货
Array(4031997, 1, 1, 1), //200
Array(1432048, 200, 1, 1), //铲子
Array(1302063, 200, 1, 1), //火刀0
Array(1302104, 100, 1, 1), //鱿鱼剑
Array(1382041, 400, 1, 1), //夜行权杖
Array(1402014, 100, 1, 1), //温度计
Array(2049100, 300, 1, 1), //混沌
Array(2340000, 300, 1, 1), //祝福
Array(2049000, 800, 1, 1), //白医
Array(4000463, 1000, 1, 1), //国庆纪念币
Array(1422030, 300, 1, 1), //海豹钝器
Array(1422031, 300, 1, 1), //海豹

Array(1102041, 200, 1, 1), //浪人披风(粉)
Array(1102042, 300, 1, 1), //浪人披风(紫)	
Array(1102040, 900, 1, 1), //浪人披风(黄)	
Array(1102043, 800, 1, 1), //浪人披风(褐)	

Array(5150040, 700, 1, 1), //皇家
Array(2022245, 500, 1, 1), //心跳糖果

Array(5152001, 700, 1, 1), //射手高级整容
Array(5390006, 800, 1, 1), //老虎喇叭
Array(2100009, 700, 1, 1), //狼人召唤包
Array(1002418, 900, 1, 1), //废报纸头盔
Array(1002419, 900, 1, 1), //枫叶帽
Array(1002424, 900, 1, 1), //红马术帽
Array(1002425, 900, 1, 1), //蓝马术帽
Array(1002554, 900, 1, 1), //武艺头绳
Array(1002677, 600, 1, 1), //玩具匠人帽
Array(1002699, 600, 1, 1), //南瓜帽子
Array(1002441, 900, 1, 1), //热血头带

Array(1002452, 1000, 1, 1), //头巾
Array(1002453, 1000, 1, 1), //头巾
Array(1002455, 1000, 1, 1), //头巾
Array(1002019, 1000, 1, 1), //头巾
Array(1002080, 1000, 1, 1), //头巾
Array(1002081, 1000, 1, 1), //头巾
Array(1002082, 1000, 1, 1), //头巾
Array(1002083, 1000, 1, 1), //头巾
Array(1082175, 1000, 1, 1), //马绍尔手套(赤)
Array(1082176, 1000, 1, 1), //马绍尔手套(青)
Array(1082177, 1000, 1, 1), //马绍尔手套(紫
Array(1082178, 1000, 1, 1), //马绍尔手套(桃)
Array(1002392, 800, 1, 1), //海盗头巾(红)
Array(1002393, 800, 1, 1), //海盗头巾(粉)
Array(1002394, 800, 1, 1), //海盗头巾(灰)
Array(1002395, 800, 1, 1), //海盗头巾(紫)
Array(1082145, 800, 1, 1), //工地手套(黄)
Array(1082146, 800, 1, 1), //工地手套(红)
Array(1082147, 800, 1, 1), //工地手套(蓝)
Array(1082148, 800, 1, 1), //工地手套(紫)
Array(1082002, 1000, 1, 1), //工地手套(白)
Array(1082149, 200, 1, 1), //工地手套(褐)
Array(1082150, 900, 1, 1), //工地手套(灰)
Array(1002894, 900, 1, 1), //粉色编织发带
Array(1002895, 900, 1, 1), //红色编织发带
Array(1002896, 900, 1, 1), //紫色编织发带
Array(1002897, 800, 1, 1), //橙色编织发带
Array(1002898, 800, 1, 1), //绿色编织发带
Array(1002899, 800, 1, 1), //黄色编织发带
Array(1002900, 800, 1, 1), //蓝色编织发带
//------脸饰------
Array(1012056, 800, 1, 1), //狗狗鼻
Array(1022047, 400, 1, 1), //猫头鹰
Array(1012058, 800, 1, 1), //匹诺曹的鼻子
Array(1012059, 800, 1, 1), //匹诺曹的鼻子
Array(1012060, 800, 1, 1), //匹诺曹的鼻子
Array(1012061, 800, 1, 1), //匹诺曹的鼻子
Array(1012084, 500, 1, 1), //白鼠面妆
Array(1012086, 600, 1, 1), //白鼠面妆
Array(1012087, 700, 1, 1), //白鼠面妆
Array(1012088, 700, 1, 1), //白鼠面妆
Array(1012266, 700, 1, 1), //白鼠面妆
Array(1122001, 700, 1, 1), //绿色蝶形领结
Array(1122002, 800, 1, 1), //红色蝶形领结
Array(1122003, 800, 1, 1), //黄色蝶形领结
Array(1122004, 800, 1, 1), //粉红蝶形领结
Array(1122005, 800, 1, 1), //黑色蝶形领结
Array(1122006, 600, 1, 1), //蓝色蝶形领结	
Array(1012073, 600, 1, 1), //西瓜雪糕	
Array(1012071, 600, 1, 1), //巧克力雪糕	
Array(1012072, 600, 1, 1), //甜瓜雪糕	
Array(1012070, 10, 1, 1), //草莓雪糕111111111111111
Array(1052202, 300, 1, 1), //品克宾套服0
Array(1072168, 1000, 1, 1), //钉鞋
Array(1072169, 1000, 1, 1), //钉鞋
Array(1072170, 1000, 1, 1), //钉鞋
Array(1072171, 1000, 1, 1), //钉鞋
Array(1072238, 400, 1, 1), //紫色钉鞋
Array(1072239, 300, 1, 1), //黄色钉鞋0
Array(1122007, 300, 1, 1), //休彼德蔓的项链

Array(1012101, 600, 1, 1), //枫叶
Array(1012102, 600, 1, 1), //枫叶
Array(1012103, 600, 1, 1), //枫叶
Array(1012098, 600, 1, 1), //枫叶

  
//------吊坠------
Array(1122015, 900, 1, 1), //枫叶围巾
Array(1122074, 900, 1, 1), //枫叶吊坠
Array(1032035, 300, 1, 1), //枫叶0
Array(1032027, 600, 1, 1), //黑水晶
Array(1032028, 400, 1, 1), //红水晶0
Array(1032026, 300, 1, 1), //黄水晶0
Array(1032032, 700, 1, 1), //秋叶耳环
Array(1032030, 900, 1, 1), //勇气耳环
//------盾牌------
Array(1092022, 500, 1, 1), //调色板盾牌

//------披风------
Array(1102053, 800, 1, 1), //破披风
Array(1102166, 1000, 1, 1), //枫叶披风
Array(1102167, 1000, 1, 1), //枫叶披风
Array(1102168, 1000, 1, 1), //枫叶披风
Array(1102011, 1000, 1, 1), //守护披风
Array(1102012, 1000, 1, 1), //守护披风
Array(1102013, 1000, 1, 1), //守护披风
Array(1102021, 1000, 1, 1), //斗士披风
Array(1102022, 1000, 1, 1), //斗士披风
Array(1102023, 1000, 1, 1), //斗士披风
Array(1102024, 1000, 1, 1), //斗士披风
Array(1102085, 800, 1, 1), //黄色盖亚披风	
Array(1102000, 1000, 1, 1), //冒险披风
Array(1102001, 1000, 1, 1), //冒险披风
Array(1102002, 1000, 1, 1), //冒险披风
Array(1102003, 1000, 1, 1), //冒险披风
Array(1102004, 1000, 1, 1), //冒险披风
Array(1102079, 1000, 1, 1), //破旧红
Array(1102081, 1000, 1, 1), //破旧黄


//-------武器------
Array(1051017, 700, 1, 1), //红色桑拿服	
Array(1050018, 700, 1, 1), //蓝色桑拿服
Array(1372017, 200, 1, 1), //领路灯
Array(1302049, 200, 1, 1), //光线鞭子	
Array(1302021, 800, 1, 1), //橡皮榔头
Array(1302022, 800, 1, 1), //竹刀
Array(1302024, 500, 1, 1), //废报纸卷
Array(1302061, 500, 1, 1), //蔓藤鞭子
Array(1302080, 600, 1, 1), //七彩霓虹灯泡
Array(1302084, 600, 1, 1), //火柴
Array(1302085, 800, 1, 1), //叉子
Array(1302087, 800, 1, 1), //火炬
Array(1312002, 900, 1, 1), //镰刀
Array(1312012, 1000, 1, 1), //乾坤圈
Array(1312013, 600, 1, 1), //判官笔
Array(1312014, 600, 1, 1), //阎王笔
Array(1402029, 10, 1, 1), //鬼刺狼牙棒
Array(1322009, 1000, 1, 1), //马桶吸
Array(1322027, 400, 1, 1), //米伽勒的平底锅
Array(1322051, 500, 1, 1), //七夕
Array(1322012, 1000, 1, 1), //红色砖头   
Array(1302014, 1000, 1, 1), //旧战
Array(1402009, 500, 1, 1), //木球棍
Array(1402010, 500, 1, 1), //铝球棍
Array(1332032, 1000, 1, 1), //圣诞树
Array(1132010, 800, 1, 1), //黄金猪猪腰带
Array(1132011, 800, 1, 1), //黄金猪猪腰带
Array(1432013, 1000, 1, 1), //南瓜枪
Array(1422036, 1000, 1, 1), //玩具匠人的锤子
Array(1322031, 1000, 1, 1), //葵花宝典
Array(1332021, 500, 1, 1), //乌龙茶
Array(1422011, 50, 1, 1), //酒瓶
Array(1472054, 400, 1, 1), //信玄
Array(1402013, 400, 1, 1), //白日剑
Array(1382015, 400, 1, 1), //毒蘑菇
Array(1302013, 1000, 1, 1), //红色鞭子
Array(1332030, 500, 1, 1), //团扇
Array(1332054, 500, 1, 1), //闪电飞刀
Array(1402044, 200, 1, 1), //南瓜灯笼
Array(1432039, 300, 1, 1), //钓鱼竿
Array(1432046, 100, 1, 1), //圣诞树手杖
Array(1442018, 100, 1, 1), //冻冻鱼
Array(1442021, 800, 1, 1), //黄拖把
Array(1442022, 600, 1, 1), //白拖把
Array(1442023, 500, 1, 1), //黑拖把
Array(1442004, 1000, 1, 1), //拖把	
Array(1432132, 500, 1, 1), //木精灵枪	
Array(1372033, 50, 1, 1), //圣贤短杖
Array(1302017, 1000, 1, 1), //蓝色雨伞	
Array(1302016, 1000, 1, 1), //黄色雨伞
Array(1302025, 600, 1, 1), //红雨伞
Array(1302026, 200, 1, 1), //黑雨伞
Array(1302027, 500, 1, 1), //绿雨伞
Array(1302028, 500, 1, 1), //紫雨伞
Array(1302029, 500, 1, 1), //褐雨伞
Array(1302035, 300, 1, 1), //枫叶旗
Array(1302036, 300, 1, 1), //枫叶旗
Array(1302058, 500, 1, 1), //冒险岛伞
Array(1302252, 400, 1, 1), //冒险岛雨伞
Array(1302076, 400, 1, 1), //马来西亚国旗（单手剑）
Array(1312036, 400, 1, 1), //马来西亚国旗（单手斧）
Array(1322058, 400, 1, 1), //马来西亚国旗（单手杖）
Array(1332061, 400, 1, 1), //马来西亚国旗（短剑）
Array(1382044, 400, 1, 1), //马来西亚国旗（长杖）
Array(1412031, 400, 1, 1), //马来西亚国旗（双手斧）
Array(1432044, 400, 1, 1), //马来西亚国旗（枪）
Array(1452050, 400, 1, 1), //马来西亚国旗（弓）
Array(1442028, 500, 1, 1), //蓝色冲浪板
Array(1442029, 500, 1, 1), //紫色冲浪板
Array(1442011, 500, 1, 1), //冲浪板
Array(1442065, 300, 1, 1), //蓝色冲浪板
Array(1442066, 300, 1, 1), //红色冲浪板.
Array(1442030, 300, 1, 1), //枫之雪板
Array(1442017, 1000, 1, 1), //赤血雪板
Array(1432015, 500, 1, 1), //红色滑雪板
Array(1432016, 400, 1, 1), //橙色滑雪板
Array(1322021, 1000, 1, 1), //游泳圈
Array(1322022, 1000, 1, 1),//游泳圈
Array(1322023, 1000, 1, 1),//游泳圈
Array(1322024, 1000, 1, 1),//游泳圈
Array(1322025, 1000, 1, 1), //游泳圈
Array(1322026, 1000, 1, 1),//游泳圈	
//------椅子------
Array(3010001, 1000, 1, 1), //蓝色木椅
Array(3010002, 1000, 1, 1), //时尚转椅
Array(3010003, 1000, 1, 1), //时尚转椅
Array(3010006, 1000, 1, 1), //时尚转椅
Array(3010007, 1000, 1, 1), //海豹靠垫
Array(3010008, 800, 1, 1), //海豹靠垫
Array(3010010, 800, 1, 1), //海豹靠垫
Array(3010016, 800, 1, 1), //海豹靠垫
Array(3010017, 800, 1, 1), //海豹靠垫
Array(3010034, 500, 1, 1), //悠长假期
Array(3010065, 500, 1, 1), //悠长假期
Array(3010035, 500, 1, 1), //悠长假期
Array(3010025, 500, 1, 1), //枫叶纪念凳
Array(3010029, 500, 1, 1), //环凳
Array(3010030, 500, 1, 1), //环凳
Array(3010031, 500, 1, 1), //环凳
Array(3010032, 500, 1, 1), //环凳
Array(3010033, 500, 1, 1), //环凳
Array(3010046, 500, 1, 1), //龙椅子
Array(3010047, 500, 1, 1), //龙椅子
Array(3010051, 700, 1, 1), //沙漠兔子1
Array(3010052, 700, 1, 1), //沙漠兔子2
Array(3010066, 200, 1, 1), //骑士宝座
Array(3010130, 200, 1, 1), //血色玫瑰
Array(3010058, 200, 1, 1), //世界末日
Array(3010009, 200, 1, 1), //踏踏
Array(3010018, 200, 1, 1), //椰子树
Array(3010019, 400, 1, 1), //寿司
Array(3010021, 400, 1, 1), //暖暖桌
Array(3010024, 400, 1, 1), //玩具熊
Array(3010114, 100, 1, 1), //海盗俘虏
Array(3010036, 100, 1, 1), //浪漫秋千
Array(3010037, 100, 1, 1), //猪猪凳子
Array(3010040, 100, 1, 1), //蝙蝠椅子
Array(3010041, 100, 1, 1), //骷髅椅子
Array(3010043, 10, 1, 1), //魔女的扫把
Array(3010048, 100, 1, 1), //圣诞树椅子
Array(3010050, 100, 1, 1), //公主凳子
Array(3010044, 100, 1, 1), //同一红伞下
Array(3010036, 100, 1, 1), //浪漫秋千
Array(3010049, 100, 1, 1), //雪房子
Array(3010054, 100, 1, 1), //呼噜呼噜
Array(3010060, 1000, 1, 1), //初心凳
Array(3010062, 1000, 1, 1), //竹凳
Array(3010068, 100, 1, 1), //露水椅子
Array(3010069, 100, 1, 1), //大黄蜂
Array(3010071, 100, 1, 1), //神兽椅子
Array(3010075, 100, 1, 1), //我为音乐狂
Array(3010077, 100, 1, 1), //猫头鹰
Array(3010093, 100, 1, 1), //火鸡
Array(3010096, 100, 1, 1), //恐龙化石
Array(3010099, 100, 1, 1), //北极熊
Array(3010106, 100, 1, 1), //雪狼椅子
Array(3012001, 100, 1, 1), //火
Array(3012002, 100, 1, 1), //浴桶
Array(3012006, 100, 1, 1), //风吹稻香
Array(3012010, 100, 1, 1), //巧克力恋人
Array(3012011, 100, 1, 1), //巧克力火锅
Array(3010055, 100, 1, 1), //冰雪丸子
Array(3010149, 100, 1, 1), //猫咪风扇
Array(3010132, 10, 1, 1), //撒娇猫0
Array(3010026, 10, 1, 1), //恶灵俯身娃娃0
Array(3010133, 100, 1, 1), //帐篷
Array(3010139, 100, 1, 1), //私密空间
Array(3013000, 100, 1, 1), //樱花树
Array(3010073, 10, 1, 1), //品克缤
Array(2002031, 1000, 1, 1), //蛋糕
Array(2002032, 1000, 1, 1), //蛋糕
Array(2002033, 1000, 1, 1), //蛋糕
Array(2002034, 1000, 1, 1), //蛋糕
Array(2020002, 1000, 1, 1), //蛋糕
Array(2020016, 1000, 1, 1), //蛋糕
Array(2002031, 1000, 1, 1), //蛋糕
Array(2002032, 1000, 1, 1), //蛋糕
Array(2002033, 1000, 1, 1), //蛋糕
Array(2002034, 1000, 1, 1), //蛋糕
Array(2020002, 1000, 1, 1), //蛋糕
Array(2020016, 1000, 1, 1), //蛋糕
Array(2002031, 1000, 1, 1), //蛋糕
Array(2002032, 1000, 1, 1), //蛋糕
Array(2002033, 1000, 1, 1), //蛋糕
Array(2002034, 1000, 1, 1), //蛋糕
Array(2020002, 1000, 1, 1), //蛋糕
Array(2020016, 1000, 1, 1), //蛋糕

///////////////////////////////////////////////
//-------盾牌------
Array(1090000, 100, 1, 1), //爱心盾牌男
Array(1091000, 100, 1, 1), //爱心盾牌女
Array(1092004, 1000, 1, 1), //骷髅盾
Array(1092006, 1000, 1, 1), //50盾
Array(1092009, 600, 1, 1), //60盾

Array(1402006, 800, 1, 1), //高原之剑
Array(1402007, 800, 1, 1), //半月巨刀
Array(1402008, 800, 1, 1), //钢铁剑
Array(1402003, 500, 1, 1), //无极剑
Array(1412000, 800, 1, 1), //双手斧
Array(1412001, 800, 1, 1), //铁斧
Array(1412002, 800, 1, 1), //钢铁斧
Array(1412003, 800, 1, 1), //太阳之斧
Array(1412004, 800, 1, 1), //绿蛇刀
Array(1412005, 800, 1, 1), //格斗斧
Array(1412006, 800, 1, 1), //重型巨斧
Array(1412007, 1000, 1, 1), //光明斧
Array(1422005, 1000, 1, 1), //黄金锤
Array(1422006, 1000, 1, 1), //十字镐
Array(1422007, 800, 1, 1), //巨人锤
Array(1422008, 1000, 1, 1), //大锤
Array(1422009, 800, 1, 1), //妖精之锤
Array(1422010, 800, 1, 1), //封魂之锤
Array(1432002, 800, 1, 1), //战士枪
Array(1432003, 800, 1, 1), //
Array(1432006, 300, 1, 1), //60
Array(1372000, 1000, 1, 1), //法师
Array(1372001, 900, 1, 1), //
Array(1372007, 900, 1, 1), //
Array(1382006, 400, 1, 1), //白龙
Array(1472003, 1000, 1, 1), //飞侠
Array(1472013, 1000, 1, 1), //
Array(1472023, 300, 1, 1), //60
Array(1452007, 1000, 1, 1), //弓手
Array(1452008, 1000, 1, 1), //
Array(1452004, 300, 1, 1) //60


);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r快乐百宝箱可以获得以下物品，99%获得\r\n\#b是否消耗一张#v5220000#？#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
		if (cm.getInventory(1).isFull(0)){//判断第一个也就是装备栏的装备栏是否有一个空格
		cm.sendOk("#b请保证装备栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
		} else if (cm.getInventory(2).isFull(0)){//判断第二个也就是消耗栏的装备栏是否有一个空格
		cm.sendOk("#b请保证消耗栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
		} else if (cm.getInventory(3).isFull(0)){//判断第三个也就是设置栏的装备栏是否有一个空格
		cm.sendOk("#b请保证设置栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
		} else if (cm.getInventory(4).isFull(0)){//判断第四个也就是其它栏的装备栏是否有一个空格
		cm.sendOk("#b请保证其它栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
		} else if (cm.getInventory(5).isFull(0)){//判断第五个也就是现金栏的装备栏是否有一个空格
		cm.sendOk("#b请保证现金栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
        } else if(cm.getPlayer().getCSPoints(1) >= 500){//判断点券
            cm.sendYesNo("  #v4000424##v3994077##v3994079##v3994076##v3994074##v3994076##v3994067##v3994077##v3994063##v4000424#\r\n#b          物品全随机 好坏全看脸 抽奖请慎重 \r\n#r                     确认抽取?"+selStr);
        } else {
            cm.sendOk("  #v4000424##v3994077##v3994079##v3994076##v3994074##v3994076##v3994067##v3994077##v3994063##v4000424#\r\n#b          物品全随机 好坏全看脸 抽奖请慎重 \r\n#r                     确认抽取?"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
		var ii = MapleItemInformationProvider.getInstance();
        var chance = Math.floor(Math.random()*800);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
           //var notice = finalitem[finalchance][3];
           // item = cm.gainGachaponItem(itemId, quantity,);//, notice
			var Laba = finalitem[finalchance][3];
			       
				   
				   if(ii.getInventoryType(itemId).getType() == 1){
			        	var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
						MapleInventoryManipulator.addFromDrop(cm.getC(),toDrop,false);
				}else{
				 	 var toDrop = new Equip(itemId,0).copy();
				cm.gainItem(itemId,quantity);
				}
				
            if (Laba == 1) {
			
			 cm.itemlaba(" 【点卷抽奖】获得，大家一起恭喜他/她吧!",toDrop)
                cm.gainDJ(-500);//扣除点券
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {//不喇叭
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到.");
            cm.gainDJ(-500);//扣除点券
            cm.safeDispose();
        }
    }
}