var status = 0;
var itemList =   
Array(   
Array(4001221, 1000, 1, 1), //
Array(4001222, 1000, 1, 1), //
Array(4001223, 1000, 1, 1), //
Array(4001224, 1000, 1, 1), //
Array(4001225, 1000, 1, 1), //
Array(4001221, 1000, 2, 1), //
Array(4001222, 1000, 2, 1), //
Array(4001223, 1000, 2, 1), //
Array(4001224, 1000, 2, 1), //
Array(4001225, 1000, 2, 1), //
Array(4001221, 1000, 5, 1), //
Array(4001222, 1000, 5, 1), //

Array(1002418, 1000, 1, 1), //废报纸头盔
Array(1002419, 1000, 1, 1), //枫叶帽
Array(1002424, 1000, 1, 1), //红马术帽
Array(1002425, 1000, 1, 1), //蓝马术帽
Array(1002554, 1000, 1, 1), //武艺头绳
Array(1002677, 1000, 1, 1), //玩具匠人帽
Array(1002699, 1000, 1, 1), //南瓜帽子
Array(1002441, 1000, 1, 1), //热血头带
Array(1002508, 1000, 1, 1), //枫叶头盔
Array(1002509, 1000, 1, 1), //枫叶头盔
Array(1002510, 1000, 1, 1), //枫叶头盔
Array(1002511, 1000, 1, 1), //枫叶头盔
Array(1002391, 1000, 1, 1), //海盗头巾(绿)
Array(1002392, 1000, 1, 1), //海盗头巾(红)
Array(1002393, 1000, 1, 1), //海盗头巾(粉)
Array(1002394, 1000, 1, 1), //海盗头巾(灰)
Array(1002395, 1000, 1, 1), //海盗头巾(紫)
Array(1002894, 1000, 1, 1), //粉色编织发带
Array(1002895, 1000, 1, 1), //红色编织发带
Array(1002896, 1000, 1, 1), //紫色编织发带
Array(1002897, 1000, 1, 1), //橙色编织发带
Array(1002898, 1000, 1, 1), //绿色编织发带
Array(1002899, 1000, 1, 1), //黄色编织发带
Array(1002900, 1000, 1, 1), //蓝色编织发带
//------脸饰------
Array(1012056, 1000, 1, 1), //狗狗鼻
Array(1022047, 1000, 1, 1), //猫头鹰
Array(1012058, 1000, 1, 1), //匹诺曹的鼻子
Array(1012059, 1000, 1, 1), //匹诺曹的鼻子
Array(1012060, 1000, 1, 1), //匹诺曹的鼻子
Array(1012061, 1000, 1, 1), //匹诺曹的鼻子
Array(1122001, 1000, 1, 1), //绿色蝶形领结
Array(1122002, 1000, 1, 1), //红色蝶形领结
Array(1122003, 1000, 1, 1), //黄色蝶形领结
Array(1122004, 1000, 1, 1), //粉红蝶形领结
Array(1122005, 1000, 1, 1), //黑色蝶形领结
Array(1122006, 1000, 1, 1), //蓝色蝶形领结
Array(1012477, 1, 1, 1), //甜瓜味雪糕	
Array(1012420, 1, 1, 1), //水果草莓味雪糕	
Array(1012419, 1, 1, 1), //甜瓜味雪糕	
Array(1012417, 1, 1, 1), //巧克力雪糕	
Array(1012418, 1, 1, 1), //西瓜味雪糕	
Array(1012416, 1, 1, 1), //草莓雪糕	
Array(1012073, 1000, 1, 1), //西瓜雪糕	
Array(1012071, 1, 1, 1), //巧克力雪糕	
Array(1012072, 1000, 1, 1), //甜瓜雪糕	
Array(1012070, 1, 1, 1), //草莓雪糕
//------吊坠------
Array(1122015, 1000, 1, 1), //枫叶围巾
Array(1122074, 1000, 1, 1), //枫叶吊坠
//------盾牌------
Array(1092022, 1000, 1, 1), //调色板盾牌
Array(1092050, 1, 1, 1), //冷艳剑盾
Array(1092049, 1, 1, 1), //热情剑盾
//------披风------
Array(1102053, 1000, 1, 1), //破披风
Array(1102166, 1000, 1,1), //枫叶披风
Array(1102167, 1000, 1, 1), //枫叶披风
Array(1102168, 1000, 1, 1), //枫叶披风
Array(1102084, 1, 1, 1), //粉红盖亚披风	
Array(1102085, 1000, 1, 1), //黄色盖亚披风	
Array(1102086, 1000, 1, 1), //紫色盖亚披风
Array(1102041, 1000, 1, 1), //浪人披风(粉)	
Array(1102040, 1000, 1, 1), //浪人披风(黄)	
Array(1102043, 1000, 1, 1), //浪人披风(褐)	
Array(1102042, 1, 1, 1), //浪人披风(紫)
Array(2070005, 1, 1, 1), //金钱镖
Array(2070006, 1, 1, 1), //齿轮镖
Array(2070007, 1, 1, 1), //月牙镖
//-------武器------
Array(1051017, 1000, 1, 1), //红色桑拿服	
Array(1050018, 1000, 1, 1), //蓝色桑拿服
Array(1372017, 1000, 1, 1), //领路灯
Array(1302049, 1, 1, 1), //光线鞭子	
Array(1302021, 1000, 1, 1), //橡皮榔头
Array(1302022, 1000, 1, 1), //竹刀
Array(1302024, 1000, 1, 1), //废报纸卷
Array(1302061, 50, 1, 1), //蔓藤鞭子
Array(1302067, 1000, 1, 1), //枫叶庆典旗
Array(1302080, 1000, 1, 1), //七彩霓虹灯泡
Array(1302084, 1000, 1, 1), //火柴
Array(1302085, 1000, 1, 1), //叉子
Array(1302087, 1000, 1, 1), //火炬
Array(1312002, 1000, 1, 1), //镰刀
Array(1312012, 1000, 1, 1), //乾坤圈
Array(1312013, 1000, 1, 1), //判官笔
Array(1312014, 1000, 1, 1), //阎王笔
Array(1402029, 1000, 1, 1), //鬼刺狼牙棒
Array(1322009, 1000, 1, 1), //马桶吸
Array(1322027, 1000, 1, 1), //米伽勒的平底锅
Array(1322051, 1000, 1, 1), //七夕
Array(1322071, 1000, 1, 1), //采矿铁锹
Array(1322053, 1000, 1, 1), //棒槌
Array(1332053, 10, 1, 1), //野外烧烤串
Array(1332054, 22, 1, 1), //闪电飞刀
Array(1382015, 1000, 1, 1), //毒蘑菇
Array(1382016, 1, 1, 1), //香菇 ——--高级货
Array(1402044, 1000, 1, 1), //南瓜灯笼
Array(1422036, 1000, 1, 1), //玩具匠人的锤子
Array(1432039, 1000, 1, 1), //钓鱼竿
Array(1432046, 1000, 1, 1), //圣诞树手杖
Array(1432048, 10, 1, 1), //铲子
Array(1442018, 10, 1, 1), //冻冻鱼
Array(1442021, 1000, 1, 1), //黄拖把
Array(1442022, 22, 1, 1), //白拖把
Array(1442023, 1000, 1, 1), //黑拖把
Array(1442004, 1000, 1, 1), //拖把
Array(1432009, 1000, 1, 1), //木精灵枪	
Array(1432132, 1000, 1, 1), //木精灵枪
Array(1372031, 1000, 1, 1), //圣贤短杖	
Array(1372033, 1000, 1, 1), //圣贤短杖
Array(1442121, 1, 1, 1), //敏捷战士的玫瑰
Array(1442122, 1, 1, 1), //恐怖战士的玫瑰
Array(1442123, 1, 1, 1), //愤怒战士的玫瑰
Array(1302017, 1000, 1, 1), //蓝色雨伞	
Array(1302016, 1000, 1, 1), //黄色雨伞
Array(1302025, 1, 1, 1), //红雨伞
Array(1302026, 1, 1, 1), //黑雨伞
Array(1302027, 1000, 1, 1), //绿雨伞
Array(1302028, 1000, 1, 1), //紫雨伞
Array(1302029, 1000, 1, 1), //褐雨伞
Array(1302035, 50, 1, 1), //枫叶旗
Array(1302036, 50, 1, 1), //枫叶旗
Array(1302058, 1000, 1, 1), //冒险岛伞
Array(1302252, 1000, 1, 1), //冒险岛雨伞
Array(1312033, 50, 1, 1), //枫叶3年旗
Array(1412028, 50, 1, 1), //枫叶3年旗
Array(1302066, 50, 1, 1), //枫叶3年旗
Array(1332057, 50, 1, 1), //枫叶3年旗
Array(1422032, 50, 1, 1), //枫叶3年旗
Array(1432041, 50, 1, 1), //枫叶3年旗
Array(1442052, 50, 1, 1), //枫叶3年旗
Array(1462041, 50, 1, 1), //枫叶3年旗
Array(1472056, 50, 1, 1), //枫叶3年旗
Array(1492034, 50, 1, 1), //枫叶3年旗
Array(1312034, 1, 1, 1), //粉色花边游泳圈
Array(1422033, 1, 1, 1), //粉色花边游泳圈
Array(1432042, 1, 1, 1), //粉色花边游泳圈
Array(1332059, 1, 1, 1), //粉色花边游泳圈
Array(1492026, 1, 1, 1), //粉色花边游泳圈
Array(1452048, 1, 1, 1), //粉色花边游泳圈
Array(1302230, 1, 1, 1), //粉色花边游泳圈
Array(1302075, 22, 1, 1), //新加坡国旗（单手剑）
Array(1302076, 22, 1, 1), //马来西亚国旗（单手剑）
Array(1312035, 22, 1, 1), //新加坡国旗（单手斧）
Array(1312036, 22, 1, 1), //马来西亚国旗（单手斧）
Array(1322057, 22, 1, 1), //新加坡国旗（单手杖）
Array(1322058, 22, 1, 1), //马来西亚国旗（单手杖）
Array(1332060, 22, 1, 1), //新加坡国旗（短剑）
Array(1332061, 22, 1, 1), //马来西亚国旗（短剑）
Array(1382043, 22, 1, 1), //新加坡国旗（长杖）
Array(1382044, 22, 1, 1), //马来西亚国旗（长杖）
Array(1402042, 22, 1, 1), //新加坡国旗（双手剑）
Array(1412030, 22, 1, 1), //新加坡国旗（双手斧）
Array(1412031, 22, 1, 1), //马来西亚国旗（双手斧）
Array(1422034, 22, 1, 1), //新加坡国旗（双手杖）
Array(1432043, 22, 1, 1), //新加坡国旗（枪）
Array(1432044, 22, 1, 1), //马来西亚国旗（枪）
Array(1442058, 22, 1, 1), //新加坡国旗（矛）
Array(1452049, 22, 1, 1), //新加坡国旗（弓）
Array(1452050, 22, 1, 1), //马来西亚国旗（弓）
Array(1442026, 1, 1, 1), //红色冲浪板
Array(1442027, 1, 1, 1), //绿色冲浪板
Array(1442028, 1, 1, 1), //蓝色冲浪板
Array(1442029, 1000, 1, 1), //紫色冲浪板
Array(1442065, 1000, 1, 1), //蓝色冲浪板
Array(1442066, 1, 1, 1), //红色冲浪板
Array(1442069, 1, 1, 1), //红色冲浪板
Array(1442070, 1, 1, 1), //绿色冲浪板
Array(1442054, 1000, 1, 1), //红色滑水板
Array(1442055, 1, 1, 1), //绿色滑水板
Array(1442056, 1, 1, 1), //蓝色滑水板
Array(1442057, 1, 1, 1), //紫色滑水板
Array(1432017, 1, 1, 1), //绿色滑雪板	
Array(1432018, 1, 1, 1), //蓝色滑雪板	
Array(1432015, 1000, 1, 1), //红色滑雪板	
Array(1432016, 22, 1, 1), //橙色滑雪板
Array(1442011, 1000, 1, 1), //冲浪板
Array(1442030, 1, 1, 1), //枫之雪板
Array(1442046, 1, 1, 1), //超级滑雪板
Array(1442039, 22, 1, 1), //冻冻鱼
//------手套------
Array(1082145, 1000, 1, 1), //工地手套(黄)
Array(1082146, 1000, 1, 1), //工地手套(红)
Array(1082147, 1000, 1, 1), //工地手套(蓝)
Array(1082148, 1000, 1, 1), //工地手套(紫)
Array(1082149, 22, 1, 1), //工地手套(褐)
Array(1082150, 1000, 1, 1), //工地手套(灰)
Array(1082002, 1000, 1, 1), //工地手套(白)
Array(1082175, 1000, 1, 1), //马绍尔手套(赤)
Array(1082176, 1000, 1, 1), //马绍尔手套(青)
Array(1082177, 1000, 1, 1), //马绍尔手套(紫
Array(1082178, 1000, 1, 1), //马绍尔手套(桃)
Array(1082179, 10, 1, 1), //马绍尔手套(黄)
//-----耳环-----
Array(1032032, 1000, 1, 1), //秋叶耳环
Array(1032035, 1000, 1, 1), //枫叶耳环
Array(1032040, 1000, 1, 1), //枫叶型耳环
Array(1032041, 1000, 1, 1), //枫叶型耳环
Array(1032042, 1000, 1, 1), //枫叶型耳环
Array(1032030, 1000, 1, 1), //勇气耳环
//-----卷轴-----
Array(2040001, 1000, 1, 1), //头盔防御卷轴60%
Array(2040002, 1000, 1, 1), //头盔防御卷轴10%
Array(2040004, 1000, 1, 1), //头盔体力卷轴60%
Array(2040005, 1000, 1, 1), //头盔体力卷轴10%
Array(2040016, 1000, 1, 1), //头盔命中率卷轴10%
Array(2040017, 1000, 1, 1), //头盔命中率卷轴60%
Array(2040025, 1000, 1, 1), //头盔智力卷轴60%
Array(2040026, 1000, 1, 1), //头盔智力卷轴10%
Array(2040029, 1000, 1, 1), //头盔敏捷卷轴60%
Array(2040031, 1000, 1, 1), //头盔敏捷卷轴10%
Array(2040100, 1000, 1, 1), //脸部装饰生命卷轴10%
Array(2040101, 1000, 1, 1), //脸部装饰生命卷轴60%
Array(2040105, 1000, 1, 1), //脸部装饰回避率卷轴10%
Array(2040106, 1000, 1, 1), //脸部装饰回避率卷轴60%
Array(2040200, 1000, 1, 1), //眼部装饰命中率卷轴10%
Array(2040201, 1000, 1, 1), //眼部装饰命中率卷轴60%
Array(2040205, 1000, 1, 1), //眼部装饰智力卷轴10%
Array(2040206, 1000, 1, 1), //眼部装饰智力卷轴60%
Array(2040301, 1000, 1, 1), //耳环智力卷轴60%
Array(2040302, 1000, 1, 1), //耳环智力卷轴10%
Array(2040310, 1000, 1, 1), //耳环防御力卷轴10%
Array(2040317, 1000, 1, 1), //耳环敏捷卷轴60%
Array(2040318, 1000, 1, 1), //耳环敏捷卷轴10%
Array(2040321, 1000, 1, 1), //耳环装饰运气卷轴60%
Array(2040323, 1000, 1, 1), //耳环运气卷轴10%
Array(2040326, 1000, 1, 1), //耳环装饰体力卷轴60%
Array(2040328, 1000, 1, 1), //耳环装饰体力卷轴10%
Array(2040401, 1000, 1, 1), //上衣防御卷轴60%
Array(2040402, 1000, 1, 1), //上衣防御卷轴10%
Array(2040412, 1000, 1, 1), //上衣运气卷轴10%
Array(2040413, 1000, 1, 1), //上衣运气卷轴60%
Array(2040418, 1000, 1, 1), //上衣力量卷轴60%
Array(2040419, 1000, 1, 1), //上衣力量卷轴10%
Array(2040421, 1000, 1, 1), //上衣体力卷轴60%
Array(2040422, 1000, 1, 1), //上衣体力卷轴10%
Array(2040425, 1000, 1, 1), //上衣运气卷轴60%
Array(2040427, 1000, 1, 1), //上衣运气卷轴10%
Array(2040501, 1000, 1, 1), //全身铠甲敏捷卷轴60%
Array(2040502, 1000, 1, 1), //全身铠甲敏捷卷轴10%
Array(2040504, 1000, 1, 1), //全身铠甲防御卷轴60%
Array(2040505, 1000, 1, 1), //全身铠甲防御卷轴10%
Array(2040513, 1000, 1, 1), //全身铠甲智力卷轴60%
Array(2040514, 1000, 1, 1), //全身铠甲智力卷轴10%
Array(2040516, 1000, 1, 1), //全身铠甲运气卷轴60%
Array(2040517, 1000, 1, 1), //全身铠甲运气卷轴10%
Array(2040532, 1000, 1, 1), //全身盔甲力量卷轴60%
Array(2040534, 1000, 1, 1), //全身盔甲力量卷轴10%
Array(2040601, 1000, 1, 1), //裤/裙防御卷轴60%
Array(2040602, 1000, 1, 1), //裤/裙防御卷轴10%
Array(2040612, 1000, 1, 1), //裤裙敏捷卷轴10%
Array(2040613, 1000, 1, 1), //裤裙敏捷卷轴60%
Array(2040618, 1000, 1, 1), //裤裙跳跃卷轴60%
Array(2040619, 1000, 1, 1), //裤裙跳跃卷轴10%
Array(2040621, 1000, 1, 1), //裤裙体力卷轴60%
Array(2040622, 1000, 1, 1), //裤裙体力卷轴10%
Array(2040625, 1000, 1, 1), //裤裙敏捷卷轴60%
Array(2040627, 1000, 1, 1), //裤裙敏捷卷轴10%
Array(2040701, 1000, 1, 1), //鞋子敏捷度卷轴60%
Array(2040702, 1000, 1, 1), //鞋子敏捷度卷轴10%
Array(2040704, 1000, 1, 1), //鞋子跳跃卷轴60%
Array(2040705, 1000, 1, 1), //鞋子跳跃卷轴10%
Array(2040707, 1000, 1, 1), //鞋子速度卷轴60%
Array(2040708, 1000, 1, 1), //鞋子速度卷轴10%
Array(2040727, 1000, 1, 1), //鞋子防滑卷轴10%
Array(2040801, 1000, 1, 1), //手套敏捷卷轴60%
Array(2040802, 1000, 1, 1), //手套敏捷卷轴10%
Array(2040804, 1000, 1, 1), //手套攻击卷轴60%
Array(2040805, 1000, 1, 1), //手套攻击卷轴10%
Array(2040816, 1000, 1, 1), //手套魔力卷轴10%
Array(2040817, 1000, 1, 1), //手套魔力卷轴60%
Array(2040824, 1000, 1, 1), //手套体力卷轴60%
Array(2040825, 1000, 1, 1), //手套体力卷轴10%
Array(2040901, 1000, 1, 1), //盾牌防御卷轴60%
Array(2040902, 1000, 1, 1), //盾牌防御卷轴10%
Array(2040914, 1000, 1, 1), //盾牌攻击卷轴60%
Array(2040915, 1000, 1, 1), //盾牌攻击卷轴10%
Array(2040919, 1000, 1, 1), //盾牌魔力卷轴60%
Array(2040920, 1000, 1, 1), //盾牌魔力卷轴10%
Array(2040924, 1000, 1, 1), //盾牌运气卷轴60%
Array(2040925, 1000, 1, 1), //盾牌运气卷轴10%
Array(2040927, 1000, 1, 1), //盾牌体力卷轴60%
Array(2040928, 1000, 1, 1), //盾牌体力卷轴10%
Array(2040931, 1000, 1, 1), //盾牌力量卷轴60%
Array(2040933, 1000, 1, 1), //盾牌力量卷轴10%
Array(2041001, 1000, 1, 1), //披风魔防卷轴60%
Array(2041002, 1000, 1, 1), //披风魔防卷轴10%
Array(2041004, 1000, 1, 1), //披风防御卷轴60%
Array(2041005, 1000, 1, 1), //披风防御卷轴10%
Array(2041007, 1000, 1, 1), //披风体力卷轴60%
Array(2041008, 1000, 1, 1), //披风体力卷轴10%
Array(2041010, 1000, 1, 1), //披风魔力卷轴60%
Array(2041011, 1000, 1, 1), //披风魔力卷轴10%
Array(2041013, 1000, 1, 1), //披风力量卷轴60%
Array(2041014, 1000, 1, 1), //披风力量卷轴10%
Array(2041016, 1000, 1, 1), //披风智力卷轴60%
Array(2041017, 1000, 1, 1), //披风智力卷轴10%
Array(2041019, 1000, 1, 1), //披风敏捷卷轴60%
Array(2041020, 1000, 1, 1), //披风敏捷卷轴10%
Array(2041022, 1000, 1, 1), //披风运气卷轴60%
Array(2041023, 1000, 1, 1), //披风运气卷轴10%
Array(2041058, 1000, 1, 1), //披风防寒卷轴10%
Array(2041201, 1000, 1, 1), //项链运气卷轴10%
Array(2041202, 1000, 1, 1), //项链运气卷轴60%
Array(2041206, 1000, 1, 1), //项链力量卷轴10%
Array(2041207, 1000, 1, 1), //项链力量卷轴60%
/*
Array(2041301, 1000, 1, 1), //腰带力量卷轴60%
Array(2041304, 1000, 1, 1), //腰带智力卷轴60%
Array(2041307, 1000, 1, 1), //腰带敏捷卷轴60%
Array(2041310, 1000, 1, 1), //腰带运气卷轴60%
*/
Array(2043001, 1000, 1, 1), //单手剑攻击卷轴60%
Array(2043002, 1000, 1, 1), //单手剑攻击卷轴10%
Array(2043008, 1000, 1, 1), //单手剑魔力卷轴10%
Array(2043009, 1000, 1, 1), //单手剑魔力卷轴60%
Array(2043017, 1000, 1, 1), //单手剑命中率卷轴60%
Array(2043019, 1000, 1, 1), //单手剑命中率卷轴10%
Array(2043101, 1000, 1, 1), //单手斧攻击卷轴60%
Array(2043102, 1000, 1, 1), //单手斧攻击卷轴10%
Array(2043112, 1000, 1, 1), //单手斧命中率卷轴60%
Array(2043114, 1000, 1, 1), //单手斧命中率卷轴10%
Array(2043201, 1000, 1, 1), //单手钝器攻击卷轴60%
Array(2043202, 1000, 1, 1), //单手钝器攻击卷轴10%
Array(2043212, 1000, 1, 1), //单手钝器命中率卷轴60%
Array(2043214, 1000, 1, 1), //单手钝器命中率卷轴10%
Array(2043301, 1000, 1, 1), //短剑攻击卷轴60%
Array(2043302, 1000, 1, 1), //短剑攻击卷轴10%
Array(2043701, 1000, 1, 1), //短杖魔力卷轴60%
Array(2043702, 1000, 1, 1), //短杖魔力卷轴10%
Array(2043801, 1000, 1, 1), //长杖魔力卷轴60%
Array(2043802, 1000, 1, 1), //长杖魔力卷轴10%
Array(2044001, 1000, 1, 1), //双手剑攻击卷轴60%
Array(2044002, 1000, 1, 1), //双手剑攻击卷轴10%
Array(2044012, 1000, 1, 1), //双手剑命中率卷轴60%
Array(2044014, 1000, 1, 1), //双手剑命中率卷轴10%
Array(2044101, 1000, 1, 1), //双手斧攻击卷轴60%
Array(2044102, 1000, 1, 1), //双手斧攻击卷轴10%
Array(2044112, 1000, 1, 1), //双手斧命中率卷轴60%
Array(2044114, 1000, 1, 1), //双手斧命中率卷轴10%
Array(2044201, 1000, 1, 1), //双手钝器攻击卷轴60%
Array(2044202, 1000, 1, 1), //双手钝器攻击卷轴10%
Array(2044212, 1000, 1, 1), //双手钝器命中率卷轴60%
Array(2044214, 1000, 1, 1), //双手钝器命中率卷轴10%
Array(2044301, 1000, 1, 1), //枪攻击卷轴60%
Array(2044302, 1000, 1, 1), //枪攻击卷轴10%
Array(2044312, 1000, 1, 1), //枪命中率卷轴60%
Array(2044314, 1000, 1, 1), //枪命中率卷轴10%
Array(2044401, 1000, 1, 1), //矛攻击卷轴60%
Array(2044402, 1000, 1, 1), //矛攻击卷轴10%
Array(2044412, 1000, 1, 1), //矛命中率卷轴60%
Array(2044414, 1000, 1, 1), //矛命中率卷轴10%
Array(2044501, 1000, 1, 1), //弓攻击卷轴60%
Array(2044502, 1000, 1, 1), //弓攻击卷轴10%
Array(2044601, 1000, 1, 1), //弩攻击卷轴60%
Array(2044602, 1000, 1, 1), //弩攻击卷轴10%
Array(2044701, 1000, 1, 1), //拳套攻击卷轴60%
Array(2044702, 1000, 1, 1), //拳套攻击卷轴10%
Array(2044801, 1000, 1, 1), //拳甲攻击卷轴60%
Array(2044802, 1000, 1, 1), //拳甲攻击卷轴10%
Array(2044807, 1000, 1, 1), //拳甲命中率卷轴60%
Array(2044809, 1000, 1, 1), //拳甲命中率卷轴10%
Array(2044901, 1000, 1, 1), //短枪攻击卷轴60%
Array(2044902, 1000, 1, 1) //短枪攻击卷轴10%
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "";//#d#v" + itemList[i][0] + "#如果要显示
            }
        if (cm.haveItem(2022428, 1)) {
            cm.sendYesNo("#v3015036##v3991012##v3991030##v3991043##v3991043##v3991047##v3015036#\r\n#v3992025##v3991002##v3991033##v3991043##v3991034##v3991044##v3991045##v3991038##v3991026##v3991044##v3992026#\r\n#r圣诞节来了，你给我带来了#v2022428#心跳箱子吗？可以获得心跳般的惊喜哦?\r\n#g拆开#v2022428#？"+selStr);
        } else {
            cm.sendOk("把#v2022428#交给我，可以获得心跳般的惊喜\r\n#g拆开心跳箱子？？?"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 200);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, notice);
            if (item != -1) {
                cm.gainItem(2022428, -1);
                cm.sendOk("你获得了 #b#v" + item + "##z" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#v2022428##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.gainItem(2022428, -1);
            cm.safeDispose();
        }
    }
}