importPackage(java.lang);
importPackage(Packages.client);
importPackage(Packages.client.inventory);
importPackage(Packages.server);
importPackage(Packages.constants);
importPackage(Packages.net.channel);
importPackage(Packages.tools);
importPackage(Packages.scripting);
importPackage(Packages.tools.packet);
importPackage(Packages.tools.data);
importPackage(Packages.tools);
var status = 0;
var itemList =   
Array(   
			Array(5150038,100,1,1),//超级明星5000016
			Array(5150040,1000,1,1),//皇家1032026
			Array(5150001,1000,1,1),//会员卡
			Array(5151001,1000,1,1),//会员卡
			Array(5152001,1000,1,1),//会员卡
			Array(5153000,1000,1,1),//会员卡
			Array(5390006,100,1,1),//咆哮喇叭5390006
			Array(5390000,1000,1,1),//喇叭5390006
			Array(5390001,1000,1,1),//喇叭5390006
			Array(5390002,1000,1,1),//喇叭5390006
			Array(5390003,1000,1,1),//喇叭5390006
			Array(5390004,1000,1,1),//喇叭5390006
			Array(5390005,100,1,1),//喇叭5390006
			Array(5152100,1000,1,1),//眼睛
			Array(5152101,1000,1,1),//眼睛
			Array(5152102,1000,1,1),//眼睛
			Array(5152103,1000,1,1),//眼睛
			Array(5152104,1000,1,1),//眼睛
			Array(5152105,1000,1,1),//眼睛
			Array(5152106,1000,1,1),//眼睛
			Array(5152107,1000,1,1),//眼睛
			Array(5110000,1000,1,1),//巧克力
			Array(4001136,1000,1,1),//卷轴碎片
			Array(4032391,1000,1,1),//卷轴碎片
			Array(4032392,1000,1,1),//卷轴碎片
			Array(4032393,1000,1,1),//卷轴碎片
			Array(4031559,1000,1,1),//卷轴碎片
			Array(4031560,1000,1,1),//卷轴碎片
			Array(4031561,1000,1,1),//卷轴碎片
			Array(1002418,1000,1,1),//废报纸头盔
			Array(1004556,200,1,1),//枫叶点状帽子
			Array(1003451,400,1,1),//枫叶头盔0
			Array(1003452,400,1,1),//枫叶头盔8
			Array(1003453,400,1,1),//枫叶头盔30
			Array(1002510,500,1,1),//枫叶头盔0
			Array(1002419,500,1,1),//枫叶帽
			Array(1002517,500,1,1),//枫叶头巾30
			Array(1002424,1000,1,1),//马术帽红
			Array(1002425,1000,1,1),//马术帽兰
			Array(1002441,1000,1,1),//热血头带
			Array(1002452,1000,1,1),//垃圾帽子
			Array(1002543,1000,1,1),//办理帽子
			Array(1002554,400,1,1),//头艺武绳
			Array(1002600,80,1,1),//枫叶头带红色
			Array(1002601,80,1,1),//枫叶头带黄色
			Array(1002602,80,1,1),//枫叶头带蓝色
			Array(1002603,800,1,1),//枫叶头带白色
			Array(1003110,1000,1,1),//枫叶头巾30蓝色
			Array(1003111,1000,1,1),//枫叶头巾30白色
			Array(1002662,1000,1,1),//结婚纪年花
			Array(1002665,1000,1,1),//西红柿帽子
			Array(1002699,200,1,1),//南瓜帽子
			Array(1002723,1000,1,1),//月饼帽子
			Array(1002737,200,1,1),//乖乖鼠头饰
			Array(1002760,1000,1,1),//地球帽
			Array(1002761,1000,1,1),//枫叶面具
			Array(1002788,800,1,1),//猫咪耳
			Array(1002799,1000,1,1),//月桂冠
			Array(1002812,200,1,1),//栀子花
			Array(1002841,1000,1,1),//幽灵小熊
			Array(1002851,100,1,1),//金鸡帽
			Array(1002894,1000,1,1),//编制发带粉
			Array(1002895,1000,1,1),//编织发带红
			Array(1002896,1000,1,1),//编织发带紫
			Array(1002897,1000,1,1),//编织发带橙
			Array(1002898,1000,1,1),//编织发带绿
			Array(1002899,1000,1,1),//编织发带黄
			Array(1002900,1000,1,1),//编织发带蓝
			Array(1002902,200,1,1),//编织发带黑+2g
			Array(1002901,1000,1,1),//编织发带白
			Array(1002391,1000,1,1),//海盗头巾(绿) 
			Array(1002392,1000,1,1),//海盗头巾(红) 
			Array(1002393,1000,1,1),//海盗头巾(粉) 
			Array(1002394,1000,1,1),//海盗头巾(灰) 
			Array(1002395,1000,1,1),//海盗头巾(紫)
			Array(1002585,1000,1,1),//蓝色烤栗贩帽子
			Array(1002586,1000,1,1),//紫色烤栗贩帽子
			Array(1002587,1000,1,1),//黑色烤栗贩帽子
			Array(1002967,1000,1,1),//晴天娃娃耳麦
			Array(1002971,300,1,1),//品克冰帽子
			Array(1002985,1000,1,1),//豆箱帽子
			Array(1002989,100,1,1),//蛋糕帽子
			Array(1002997,1000,1,1),//克冰尖角
			Array(1003027,100,1,1),//魔女帽子
			Array(1003075,1000,1,1),//白色发箍
			Array(1003273,1000,1,1),//？？？？
			Array(1022021,200,1,1),//晕乎乎眼睑
			Array(1022022,200,1,1),//晕乎乎眼镜
			Array(1022066,200,1,1),//蓝海星眼睛
			Array(1022047,100,1,1),//猫头鹰
			Array(1022058,100,1,1),//狸猫
			Array(1022060,100,1,1),//狐猴
			Array(1022067,100,1,1),//黑狐猴
			Array(1032025,400,1,1),//绿叶子耳环
			Array(1032032,400,1,1),//秋叶耳环
			Array(1032041,400,1,1),//枫叶耳环
			Array(1032040,400,1,1),//枫叶耳环
			Array(1032041,400,1,1),//枫叶耳环
			Array(1032042,400,1,1),//枫叶耳环
			Array(1032047,400,1,1),//可乐耳环
			Array(1032059,400,1,1),//零度可乐耳环
			Array(1032098,100,1,1),//胡萝卜耳环
			Array(1032026,100,1,1),//黄水晶耳环
			Array(1032027,400,1,1),//黑水晶耳环
			Array(1032028,100,1,1),//红水晶耳环
			Array(1012056,500,1,1),//狗鼻子
			Array(1012325,80,1,1),//枫叶面试
			Array(1012377,80,1,1),//枫叶口香糖
			Array(1012376,1,1,1),//枫叶口香糖
			Array(1012471,1,1,1),//枫叶口香糖
			Array(1012011,100,1,1),//圣诞鹿鼻子
			Array(1012012,100,1,1),//圣诞鹿鼻子
			Array(1012013,100,1,1),//圣诞鹿鼻子
			Array(1012014,100,1,1),//圣诞鹿鼻子
			Array(1012015,100,1,1),//圣诞鹿鼻子
			Array(1012016,100,1,1),//圣诞鹿鼻子
			Array(1012017,100,1,1),//圣诞鹿鼻子
			Array(1012018,100,1,1),//圣诞鹿鼻子
			Array(1012019,100,1,1),//圣诞鹿鼻子
			Array(1012020,100,1,1),//圣诞鹿鼻子
			Array(1012058,150,1,1),//匹诺曹鼻子
			Array(1012059,150,1,1),//匹诺曹鼻子
			Array(1012060,150,1,1),//匹诺曹鼻子
			Array(1012061,150,1,1),//匹诺曹鼻子
			Array(1012070,80,1,1),//草莓雪糕
			Array(1012071,80,1,1),//巧克力雪糕
			Array(1012072,300,1,1),//甜瓜雪糕
			Array(1012073,300,1,1),//西瓜雪糕
			//Array(1012084,400,1,1),//小白鼠面状
			//Array(1012086,400,1,1),//小白鼠面状
			//Array(1012087,400,1,1),//小白鼠面状
			//Array(1012088,400,1,1),//小白鼠面状
			Array(1012100,800,1,1),//粉色粉扑
			Array(1012132,50,1,1),//鸟嘴
			Array(1012146,50,1,1),//玩具红鼻子
			Array(1082145,300,1,1),//工地黄
			Array(1082146,300,1,1),//工地红
			Array(1082147,300,1,1),//工地兰
			Array(1082148,300,1,1),//工地紫
			Array(1082149,100,1,1),//工地褐
			Array(1082150,300,1,1),//工地灰
			Array(1082252,500,1,1),//枫叶手套
			Array(1092022,100,1,1),//调色板盾牌
			Array(1092035,100,1,1),//调色板盾牌
			Array(1092039,100,1,1),//枯叶盾牌点状
			Array(1092045,80,1,1),//枫叶魔法师盾牌
			Array(1092047,80,1,1),//枫叶飞侠盾牌
			Array(1092050,80,1,1),//飞侠双刀流盾牌
			Array(1092051,500,1,1),//啤酒盾牌
			Array(1092054,80,1,1),//通用饮料盾牌
			Array(1102079,1000,1,1),//破旧的红色披风
			Array(1102081,1000,1,1),//破旧的黄色披风
			Array(1102082,500,1,1),//破旧的黑色披风
			Array(1102040,100,1,1),//浪人披风黄
			Array(1102041,100,1,1),//浪人披风粉
			Array(1102042,100,1,1),//浪人披风紫
			Array(1102043,100,1,1),//浪人披风褐
			Array(1102166,500,1,1),//枫叶披风20
			Array(1102167,400,1,1),//枫叶披风40
			Array(1102297,80,1,1),//气球披风
			Array(1102298,80,1,1),//气球披风
			Array(1102299,80,1,1),//气球披风
			Array(1102379,200,1,1),//气球披风
			Array(1072262,400,1,1),//黑色桃乐斯皮鞋
			Array(1072264,400,1,1),//银色桃乐斯皮鞋
			Array(1072263,500,1,1),//绿色桃乐斯皮鞋
			Array(1072239,100,1,1),//黄色钉鞋
			Array(1072238,100,1,1),//紫金钉鞋
			Array(1050100,100,1,1),//浴巾男
			Array(1050127,80,1,1),//浴巾男+2敏捷
			Array(1051098,100,1,1),//浴巾女
			Array(1051140,100,1,1),//浴巾女
        	Array(1402014,10,1,1),//温度计
			Array(1382015,10,1,1),//毒蘑菇
			Array(1382016,10,1,1),//香菇
			Array(1302080,100,1,1),//冒险岛小灯泡
			Array(1302085,100,1,1),//叉子
			Array(1302087,1000,1,1),//火炬
			Array(1402044,10,1,1),//南瓜灯笼
			Array(1302061,100,1,1),//蔓藤鞭子
			Array(1432046,300,1,1),//圣诞树手杖
			Array(1432013,100,1,1),//南瓜枪
        	Array(1302024,500,1,1),//废报纸武器
        	Array(1422011,300,1,1),//酒瓶
        	Array(1332053,100,1,1),//野外烧烤
        	Array(1372017,100,1,1),//领路灯
        	Array(1422036,100,1,1),//玩具锤子
			Array(1302021,1000,1,1),//玩具锤子1302021
        	Array(1322027,300,1,1),//平底锅
        	Array(1442039,100,1,1),//冻冻鱼
        	Array(1332021,100,1,1),//乌龙茶
			Array(1302049,100,1,1),//光线鞭
			Array(1312012,500,1,1),//呼啦圈
			Array(1322006,1000,1,1),//钢管
			Array(1302339,1000,1,1),//勺子
			Array(1302340,1000,1,1),//勺子
			Array(1302341,1000,1,1),//勺子
			Array(1312013,600,1,1),//盘关闭
			Array(1312014,600,1,1),//盐王笔
			Array(1322034,1000,1,1),//铁棍
			Array(1322051,1000,1,1),//七夕
			Array(1322102,1000,1,1),//蛋糕
			Array(1332030,200,1,1),//团扇
			Array(1372008,100,1,1),//扇子
			Array(1332048,100,1,1),//扇子
			Array(1442065,100,1,1),//冲浪板30
			Array(1442066,100,1,1),//冲浪板55
			Array(1442121,100,1,1),//玫瑰30
			Array(1442122,100,1,1),//玫瑰60
			Array(1442123,100,1,1),//玫瑰90
			Array(1302058,100,1,1),//枫叶伞
			Array(1302025,500,1,1),//红雨伞
			Array(1302026,200,1,1),//黑玉山
			Array(1302027,800,1,1),//旅玉山
			Array(1302028,800,1,1),//紫雨伞
			Array(1302029,500,1,1),//褐雨伞
			Array(1302071,1000,1,1),//粉色游泳圈
			Array(1322021,1000,1,1),//游泳圈
			Array(1322022,500,1,1),//游泳圈
			Array(1322023,1000,1,1),//游泳圈
			Array(1322024,300,1,1),//游泳圈
			Array(1432015,400,1,1),//红色滑雪板
			Array(1432016,400,1,1),//橙色滑雪板
			Array(1432017,300,1,1),//绿色滑雪板
			Array(1432018,200,1,1),//蓝色滑雪板
			Array(1442054,1000,1,1),//滑板
			Array(1442055,300,1,1),//滑板
			Array(1442012,1000,1,1),//雪板0
			Array(1442013,1000,1,1),//雪板12
			Array(1442014,1000,1,1),//雪板24
			Array(1442015,700,1,1),//雪板36
			Array(1442030,100,1,1),//
			Array(1442021,1000,1,1),//黄拖把
			Array(1442022,80,1,1),//白拖把
			Array(1442023,700,1,1),//黑拖把
			Array(1422030,10,1,1),//粉红海豹抱枕
			Array(1422031,10,1,1),//蓝色海豹抱枕
			Array(1422011,300,1,1),//清酒
			Array(2000005,100,1,1),//超级药水
			Array(2000004,500,1,1),//药水		
        	Array(3010112,500,1,1),//情书柜子
		    Array(3010043,100,1,1),//魔女的飞扫把
		    Array(3015051,10,1,1),//巨无霸国际巨星
		    Array(3015183,10,1,1),//绿水灵背景椅子
		    Array(3015096,10,1,1),//羊羊幻想牧场椅子
		    Array(3010180,1000,1,1),//HP椅子
		    Array(3010009,10,1,1),//粉色爱心马桶
		    Array(3010028,100,1,1),//老海盗椅子
		    Array(3012006,50,1,1),//风吹稻香
        	Array(3010013,10,1,1),//悠长假期
        	Array(3010014,500,1,1),//月亮弯
        	Array(3010018,1000,1,1),//椰子树沙滩椅
        	Array(3010025,1000,1,1),//枫叶纪念凳
        	Array(3012001,1000,1,1),//篝火
        	Array(3012002,100,1,1),//浴桶---
        	Array(3010073,10,1,1),//PB克缤
        	Array(3010049,50,1,1),//雪房子
        	Array(3010068,50,1,1),//露水椅子
        	Array(3010070,10,1,1),//巨无霸品克缤
        	Array(3010095,100,1,1),//石头人座椅
//-----后期植入椅子-----
        	Array(3010898,500,1,1),//迷你神兽椅子
        	Array(3010465,500,1,1),//可爱音符椅子
        	Array(3010460,100,1,1),//爆竹椅子
        	Array(3010450,100,1,1),//艾莉珍椅子
        	Array(3010455,100,1,1),//扎昆的帝王椅子
        	Array(3010456,100,1,1),//杜鹃花椅子
        	Array(3010458,100,1,1),//翻滚兔子椅子
        	Array(3010863,50,1,1),//愤怒的美发师椅子
        	Array(3010447,100,1,1),//睡觉小鸟椅子
        	Array(3010446,100,1,1),//皮肤皇后椅子
        	Array(3010448,100,1,1),//泡泡浴椅子
        	Array(3010434,100,1,1),//热带夏日椅子
        	Array(3010428,100,1,1),//水晶椅子
        	Array(3010409,100,1,1),//粽子椅子
      	    Array(3010094,100,1,1),//漂漂猪椅子-----------------------
        	Array(3010411,100,1,1),//鱼尾狮椅子
        	Array(3010085,50,1,1),//鬼娃娃椅子
        	Array(3010077,100,1,1),//猫头鹰椅子
        	Array(3010053,50,1,1),//兔子纪念版椅子
        	Array(3010151,200,1,1),//无人岛椅子
        	Array(3015415,50,1,1),//猴子椅子
        	Array(3010142,50,1,1),//水族馆椅子
        	Array(3010144,100,1,1),//七夕椅子
        	Array(3015430,100,1,1),//年兽椅子
        	Array(3010117,100,1,1),//魔法书椅子
        	Array(3015424,100,1,1),//超级饺子椅子
        	Array(3015428,100,1,1),//和猴子一起放烟花椅子
        	Array(3015427,100,1,1),//和猴子一起玩麻将椅子
        	Array(3010804,100,1,1),//军人月妙拜年椅子
        	Array(3015045,50,1,1),//羊绒咩咩椅子--------------
        	Array(3010375,50,1,1),//奥妙的超级药水椅子
        	Array(3015057,50,1,1),//烟花绽放椅子
        	Array(3010373,50,1,1),//云朵洗手间椅子
        	Array(3010799,50,1,1),//坟墓幽灵椅子
        	Array(3010737,50,1,1),//动物英雄团椅子
        	Array(3010734,100,1,1),//猫箱椅子
        	Array(3010738,50,1,1),//闪电三人组椅子
        	Array(3010740,100,1,1),//圣诞树椅子
        	Array(3010365,100,1,1),//休彼德蔓的古代石掌椅子
        	Array(3010306,100,1,1),//生如夏花椅子
        	Array(3010301,50,1,1),//高级HP药水椅子
        	Array(3010188,100,1,1),//班·雷昂椅子
        	Array(3010186,100,1,1),//兔子椅子
        	Array(3010184,50,1,1),//冰钓椅子
         	Array(3010173,50,1,1),//万圣节塔罗椅子
        	Array(3010175,50,1,1),//名画家椅子
        	Array(3010195,100,1,1),//无价之宝椅子
        	Array(3010210,100,1,1),//草莓冰淇淋月饼椅子--------------
        	Array(3010224,300,1,1),//年糕冰淇淋椅子
        	Array(3010036,50,1,1),//浪漫秋千
        	Array(3010044,50,1,1),//同一红伞下
        	Array(3010111,100,1,1),//虎虎生威
        	Array(3010115,100,1,1),//熊宝宝床
        	Array(3010126,50,1,1),//蝙蝠魔王座
        	Array(3010313,50,1,1),//粉红扎昆椅子
        	Array(3010128,50,1,1),//黑龙王座
        	Array(3010133,50,1,1),//帐篷椅
        	Array(3010152,200,1,1),//黄三角帐篷椅
        	Array(3010291,50,1,1),//早日康复床
        	Array(3010172,50,1,1),//星空椅子
        	Array(3010168,50,1,1),//友谊万岁椅子
        	Array(3010185,100,1,1),//小伙伴品克缤
        	Array(3010622,100,1,1),//我的好友丹珍之椅
        	Array(3010453,50,1,1),//兔子乘风椅
        	Array(3010493,50,1,1),//那就是我--------------------------------
        	Array(3010527,50,1,1),//深海章鱼
        	Array(3010531,50,1,1),//小企鹅合唱团
        	Array(3010565,50,1,1),//我的女皇椅子
        	Array(3010587,50,1,1),//时间胶囊
        	Array(3010609,50,1,1),//不是在做梦
        	Array(3010608,50,1,1),//完美的名画椅子
        	Array(3010661,50,1,1),//欢乐相框椅子
        	Array(3010678,50,1,1),//海加顿之安息
        	Array(3010739,50,1,1),//雪人香波椅子
        	Array(3010744,50,1,1),//冒险岛的砖头朋友们
        	Array(3010752,50,1,1),//玫瑰鸟笼
        	Array(3010756,50,1,1),//新年招财猫椅子
        	Array(3010767,50,1,1),//雪人椅子
        	Array(3010760,50,1,1),//古代浴池椅子
        	Array(3010795,50,1,1),//森林中休息处
        	Array(3010806,50,1,1),//桃樱芳菲椅
        	Array(3010848,50,1,1),//红地毯主人公椅子
        	Array(3012024,100,1,1)//沙滩排球椅子
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r快乐百宝箱可以获得以下物品，99%获得\r\n\#b是否消耗一张#v5220000#？#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
        if (cm.haveItem(4170005, 1)) {//判断物品
            cm.sendYesNo("如果你有#v4170005#我可以帮你砸开，看看里面有什么？\r\n#g砸？"+selStr);
        } else {
            cm.sendOk("如果你有#v4170005#我可以帮你砸开，看看里面有什么？\r\n#e奖品列表："+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
		var ii = MapleItemInformationProvider.getInstance();
        var chance = Math.floor(Math.random()*800);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
           //var notice = finalitem[finalchance][3];
           // item = cm.gainGachaponItem(itemId, quantity,);//, notice
			var Laba = finalitem[finalchance][3];
			       
				   
				   if(ii.getInventoryType(itemId).getType() == 1){
			        	var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
						MapleInventoryManipulator.addFromDrop(cm.getC(),toDrop,false);
				}else{
				 	 var toDrop = new Equip(itemId,0).copy();
				cm.gainItem(itemId,quantity);
				}
				
            if (Laba == 1) {
			
			 cm.itemlaba("喜从天降",toDrop)
                cm.gainItem(4170005, -1);//扣除物品
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {//不喇叭
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.gainItem(4170005, -1);//扣除物品
            cm.safeDispose();
        }
    }
}