importPackage(java.lang);
importPackage(Packages.client);
importPackage(Packages.client.inventory);
importPackage(Packages.server);
importPackage(Packages.constants);
importPackage(Packages.net.channel);
importPackage(Packages.tools);
importPackage(Packages.scripting);
importPackage(Packages.tools.packet);
importPackage(Packages.tools.data);
importPackage(Packages.tools);
var status = 0;
var itemList =   
Array(

Array(1402037, 100, 1, 1), //龙背
Array(1402063, 200, 1, 1), //樱花伞
Array(1382016, 300, 1, 1), //香菇 ——--高级货
Array(1432048, 200, 1, 1), //铲子
Array(1302063, 300, 1, 1), //火刀0
Array(1302106, 200, 1, 1), //冰刀0
Array(1402014, 400, 1, 1), //温度计
Array(1432037, 400, 1, 1), //枫叶大将旗0
Array(4031997, 100, 1, 1), //100元
Array(2049100, 400, 1, 1), //混沌
Array(2340000, 400, 1, 1), //祝福
Array(2049000, 1000, 1, 1), //白医
Array(1372035, 600, 1, 1), //属性
Array(1372036, 600, 1, 1), //属性
Array(1372037, 600, 1, 1), //属性
Array(1372038, 600, 1, 1), //属性

Array(1382045, 400, 1, 1), //属性
Array(1382046, 400, 1, 1), //属性
Array(1382047, 400, 1, 1), //属性
Array(1382048, 400, 1, 1), //属性
Array(1382037, 400, 1, 1), //月仗

Array(1302064, 500, 1, 1), //64
Array(1312032, 500, 1, 1), //64
Array(1322054, 500, 1, 1), //64
Array(1332055, 500, 1, 1), //64
Array(1332056, 500, 1, 1), //64
Array(1372034, 500, 1, 1), //64
Array(1382039, 500, 1, 1), //64

Array(1412027, 500, 1, 1), //64
Array(1422029, 500, 1, 1), //64
Array(1432040, 500, 1, 1), //64
Array(1442051, 500, 1, 1), //64
Array(1452045, 500, 1, 1), //64

Array(1462040, 500, 1, 1), //64
Array(1472055, 500, 1, 1), //64
Array(1482022, 500, 1, 1), //64
Array(1492022, 500, 1, 1), //64

Array(1422030, 200, 1, 1), //海豹钝器
Array(1422031, 200, 1, 1), //海豹
Array(1482088, 200, 1, 1), //恐怖海盗
Array(1452115, 200, 1, 1), //恐怖弓
Array(1332134, 200, 1, 1), //恐怖匕首
Array(1472126, 200, 1, 1), //恐怖手套
Array(1382110, 200, 1, 1), //恐怖仗
Array(1462103, 200, 1, 1), //恐怖弩
Array(1302161, 200, 1, 1), //恐怖鞭

Array(1442122, 200, 1, 1), //恐怖战士玫瑰
Array(1102084, 100, 1, 1), //粉红盖亚披风	
Array(1102086, 300, 1, 1), //紫色盖亚披风
Array(1102085, 800, 1, 1), //黄色盖亚披风
Array(1102041, 200, 1, 1), //浪人披风(粉)
Array(1102042, 300, 1, 1), //浪人披风(紫)	
Array(1102040, 900, 1, 1), //浪人披风(黄)	
Array(1102043, 800, 1, 1), //浪人披风(褐)	


Array(2070005, 400, 1, 1), //金钱镖
Array(5150040, 700, 1, 1), //皇家
Array(5150038, 400, 1, 1), //超级明星美发卡
Array(2022245, 500, 1, 1), //心跳糖果

Array(5152001, 600, 1, 1), //射手高级整容
Array(5211047, 300, 1, 1), //双倍
Array(5360014, 300, 1, 1), //双爆

Array(5041000, 600, 1, 1), //顺移
Array(5390006, 800, 1, 1), //老虎喇叭
Array(5077000, 800, 1, 1), //喇叭
Array(2100009, 600, 1, 1), //狼人召唤包
Array(1002418, 900, 1, 1), //废报纸头盔
Array(1002419, 900, 1, 1), //枫叶帽
Array(1002424, 900, 1, 1), //红马术帽
Array(1002425, 900, 1, 1), //蓝马术帽
Array(1002554, 900, 1, 1), //武艺头绳
Array(1002677, 600, 1, 1), //玩具匠人帽
Array(1002699, 600, 1, 1), //南瓜帽子
Array(1002441, 900, 1, 1), //热血头带

Array(1002392, 900, 1, 1), //海盗头巾(红)
Array(1002393, 900, 1, 1), //海盗头巾(粉)
Array(1002394, 900, 1, 1), //海盗头巾(灰)
Array(1002395, 900, 1, 1), //海盗头巾(紫)
Array(1082145, 900, 1, 1), //工地手套(黄)
Array(1082146, 900, 1, 1), //工地手套(红)
Array(1082147, 900, 1, 1), //工地手套(蓝)
Array(1082148, 900, 1, 1), //工地手套(紫)
Array(1082149, 400, 1, 1), //工地手套(褐)
Array(1082150, 900, 1, 1), //工地手套(灰)
Array(1002894, 900, 1, 1), //粉色编织发带
Array(1002895, 900, 1, 1), //红色编织发带
Array(1002896, 900, 1, 1), //紫色编织发带
Array(1002897, 800, 1, 1), //橙色编织发带
Array(1002898, 800, 1, 1), //绿色编织发带
Array(1002899, 800, 1, 1), //黄色编织发带
Array(1002900, 800, 1, 1), //蓝色编织发带
//------脸饰------
Array(1012056, 800, 1, 1), //狗狗鼻
Array(1022047, 600, 1, 1), //猫头鹰
Array(1022058, 500, 1, 1), //狸猫...........
Array(1022067, 200, 1, 1), //黑狐猴
Array(1012058, 800, 1, 1), //匹诺曹的鼻子
Array(1012059, 800, 1, 1), //匹诺曹的鼻子
Array(1012060, 800, 1, 1), //匹诺曹的鼻子
Array(1012061, 800, 1, 1), //匹诺曹的鼻子
Array(1012073, 600, 1, 1), //西瓜雪糕	
Array(1012071, 600, 1, 1), //巧克力雪糕	
Array(1012072, 600, 1, 1), //甜瓜雪糕	
Array(1012070, 200, 1, 1), //草莓雪糕111111111111111
Array(1052202, 600, 1, 1), //品克宾套服0
Array(1072238, 600, 1, 1), //紫色钉鞋
Array(1072239, 400, 1, 1), //黄色钉鞋0
Array(1122007, 400, 1, 1), //休彼德蔓的项链
Array(1122058, 200, 1, 1), //休彼德蔓混沌的项链
Array(1032099, 200, 1, 1), //葡萄吊坠0
Array(1132088, 200, 1, 1), //葡萄0
Array(1122109, 200, 1, 1), //葡萄
Array(1032098, 200, 1, 1), //萝卜011111111111111111
Array(1012101, 500, 1, 1), //枫叶
Array(1012102, 500, 1, 1), //枫叶
Array(1012103, 500, 1, 1), //枫叶
Array(1012098, 500, 1, 1), //枫叶
Array(1012161, 200, 1, 1), //发光鼻子
Array(1012269, 200, 1, 1), //发光鼻子
Array(1032058, 800, 1, 1), //工作人员接收.

  
//------吊坠------
Array(1122015, 900, 1, 1), //枫叶围巾
Array(1122074, 900, 1, 1), //枫叶吊坠
Array(1032076, 300, 1, 1), //猫头鹰
Array(1032035, 300, 1, 1), //枫叶0
Array(1032027, 600, 1, 1), //黑水晶
Array(1032028, 400, 1, 1), //红水晶0
Array(1032026, 300, 1, 1), //黄水晶0
Array(1032032, 900, 1, 1), //秋叶耳环
Array(1032030, 900, 1, 1), //勇气耳环
//------盾牌------
Array(1092022, 400, 1, 1), //调色板盾牌
Array(1092050, 200, 1, 1), //冷艳剑盾
Array(1092049, 100, 1, 1), //热情剑盾
//------椅子------
Array(3010007, 800, 1, 1), //海豹靠垫
Array(3010008, 800, 1, 1), //海豹靠垫
Array(3010010, 800, 1, 1), //海豹靠垫
Array(3010016, 900, 1, 1), //海豹靠垫
Array(3010017, 900, 1, 1), //海豹靠垫
Array(3010034, 800, 1, 1), //悠长假期
Array(3010065, 800, 1, 1), //悠长假期
Array(3010035, 700, 1, 1), //悠长假期

Array(3010029, 500, 1, 1), //环凳
Array(3010030, 500, 1, 1), //环凳
Array(3010031, 500, 1, 1), //环凳
Array(3010032, 500, 1, 1), //环凳
Array(3010033, 500, 1, 1), //环凳
Array(3010046, 500, 1, 1), //龙椅子
Array(3010047, 500, 1, 1), //龙椅子
Array(3010051, 700, 1, 1), //沙漠兔子1
Array(3010052, 700, 1, 1), //沙漠兔子2
Array(3010066, 200, 1, 1), //骑士宝座
Array(3010130, 200, 1, 1), //血色玫瑰
Array(3010058, 200, 1, 1), //世界末日
Array(3010009, 200, 1, 1), //踏踏
Array(3010018, 200, 1, 1), //椰子树
Array(3010019, 400, 1, 1), //寿司
Array(3010021, 400, 1, 1), //暖暖桌
Array(3010024, 400, 1, 1), //玩具熊
Array(3010037, 300, 1, 1), //猪猪凳子
Array(3010040, 300, 1, 1), //蝙蝠椅子
Array(3010041, 300, 1, 1), //骷髅椅子
Array(3010048, 300, 1, 1), //圣诞树椅子
Array(3010050, 300, 1, 1), //公主凳子
Array(3010069, 300, 1, 1), //大黄蜂
Array(3010071, 300, 1, 1), //神兽椅子
Array(3010075, 300, 1, 1), //我为音乐狂
Array(3010077, 300, 1, 1), //猫头鹰
Array(3010093, 300, 1, 1), //火鸡
Array(3010096, 300, 1, 1), //恐龙化石
Array(3010099, 300, 1, 1), //北极熊
Array(3010106, 300, 1, 1), //雪狼椅子
Array(3012001, 300, 1, 1), //火
Array(3012002, 300, 1, 1), //浴桶
Array(3012006, 300, 1, 1), //风吹稻香
Array(3012010, 300, 1, 1), //巧克力恋人
Array(3012011, 300, 1, 1), //巧克力火锅
Array(3010055, 300, 1, 1), //冰雪丸子
Array(3010026, 200, 1, 1), //恶灵俯身娃娃0
Array(3010133, 200, 1, 1), //帐篷
Array(3013000, 200, 1, 1), //樱花树
Array(3015304, 200, 1, 1), //哗啦啦大水车
Array(3015051, 200, 1, 1), //巨无霸国际巨星
Array(3010070, 200, 1, 1), //巨无霸品克缤
Array(3010073, 500, 1, 1), //BABY
Array(3015172, 300, 1, 1), //幻想牧场椅子
Array(3010976, 300, 1, 1), //为我加油！椅子
Array(3010206, 300, 1, 1), //梦想画家椅子
Array(3010151, 300, 1, 1), //无人岛椅子
Array(3010848, 200, 1, 1), //红地毯主人公椅子
Array(3010044, 400, 1, 1), //同一红伞下
Array(3010199, 700, 1, 1), //雪房子
Array(3010795, 500, 1, 1), //森林中休息处
Array(3010494, 200, 1, 1), //TV椅子
Array(3010465, 500, 1, 1), //可爱音符椅子
Array(3010450, 200, 1, 1), //艾莉珍椅子0
Array(3010447, 800, 1, 1), //睡觉小鸟1
Array(3010448, 200, 1, 1), //泡泡浴椅子0
Array(3010431, 500, 1, 1), //夏日喵喵椅子
Array(3015041, 500, 1, 1), //舒适大白熊椅子
Array(3010373, 400, 1, 1), //云朵洗手间椅子
Array(3012024, 200, 1, 1), //沙滩排球椅子0
Array(3010544, 600, 1, 1), //热带夏日椅子1
Array(3010850, 400, 1, 1), //潮流评论家椅子
Array(3010168, 400, 1, 1), //友谊万岁椅子0
Array(3010142, 200, 1, 1), //水族馆椅子0
Array(3010114, 200, 1, 1), //海盗0
Array(3010036, 300, 1, 1), //浪漫秋千
Array(3010043, 200, 1, 1), //魔女扫把0
Array(3010054, 200, 1, 1), //咕噜咕噜
Array(3010098, 200, 1, 1), //电视
Array(3010116, 200, 1, 1), //摇滚
Array(3010112, 300, 1, 1), //情书椅子
Array(3010132, 200, 1, 1), //撒娇猫咪0
Array(3010133, 300, 1, 1), //帐篷
Array(3010053, 300, 1, 1), //兔子纪念
Array(3010140, 300, 1, 1), //早日康复0
Array(3010320, 200, 1, 1), //老奶奶童话0
Array(3012019, 200, 1, 1), //爱琴海0
Array(3010606, 200, 1, 1), //画画0
Array(3010863, 200, 1, 1), //剪头0
Array(3010716, 200, 1, 1), //蘑菇椅子0
Array(3015264, 200, 1, 1), //主妇椅子0
Array(3015100, 200, 1, 1), //奥斯卡兔子0
Array(3010180, 300, 1, 1), //HP
Array(3010181, 300, 1, 1), //MP
Array(3010300, 300, 1, 1), //橙
Array(3010302, 300, 1, 1), //超级药水

//------披风------

Array(1102079, 1000, 1, 1), //破旧红
Array(1102081, 1000, 1, 1), //破旧黄
Array(1102082, 400, 1, 1), //破旧黑色0

//-------武器------
Array(1051017, 1000, 1, 1), //红色桑拿服	
Array(1050018, 1000, 1, 1), //蓝色桑拿服
Array(1051140, 500, 1, 1), //浴衣女
Array(1050127, 500, 1, 1), //浴衣男
Array(1432157, 700, 1, 1), //热狗
Array(1442050, 500, 1, 1), //热狗
Array(1332020, 1000, 1, 1), //太极扇
Array(1372008, 1000, 1, 1), //红太极扇
Array(1402017, 1000, 1, 1), //船长佩剑
Array(1302019, 1000, 1, 1), //无名剑
Array(1302013, 1000, 1, 1), //红色鞭子
Array(1302061, 1000, 1, 1), //蔓藤鞭子
Array(1302049, 1000, 1, 1), //光线鞭子
Array(1382011, 500, 1, 1), //日本法仗	
Array(1442095, 500, 1, 1), //觉醒矛	
Array(1452018, 400, 1, 1), //天蝎弓			
Array(1442106, 600, 1, 1), //战神矛		
Array(1002419, 1000, 1, 1), //枫叶帽子
	
Array(1322031, 600, 1, 1), //葵花
Array(1322012, 700, 1, 1), //砖头
Array(1322003, 500, 1, 1), //棒棒糖
Array(1302021, 500, 1, 1), //橡皮榔头
Array(1302022, 900, 1, 1), //竹刀
Array(1302037, 900, 1, 1), //小号
Array(1402009, 800, 1, 1), //棒球
Array(1402010, 800, 1, 1), //铁棒球
Array(1302024, 900, 1, 1), //废报纸卷
Array(1302080, 900, 1, 1), //七彩霓虹灯泡
Array(1302085, 800, 1, 1), //叉子
Array(1302087, 800, 1, 1), //火炬
Array(1432014, 900, 1, 1), //海神插
Array(1312012, 900, 1, 1), //乾坤圈
Array(1312013, 900, 1, 1), //判官笔
Array(1312014, 900, 1, 1), //阎王笔
Array(1422011, 600, 1, 1), //酒瓶

Array(1402029, 400, 1, 1), //鬼刺狼牙棒
Array(1322027, 1000, 1, 1), //米伽勒的平底锅
Array(1322051, 1000, 1, 1), //七夕
Array(1432046, 1000, 1, 1), //圣诞树手杖
Array(1332053, 400, 1, 1), //野外烧烤串
Array(1332054, 800, 1, 1), //闪电飞刀
Array(1472054, 700, 1, 1), //玄信

Array(1382015, 800, 1, 1), //毒蘑菇
Array(1402013, 800, 1, 1), //白日剑
Array(1372017, 800, 1, 1), //领路灯
Array(1402044, 400, 1, 1), //南瓜灯笼
Array(1422036, 600, 1, 1), //玩具匠人的锤子
Array(1432039, 800, 1, 1), //钓鱼竿
Array(1442018, 400, 1, 1), //冻冻鱼
Array(1442021, 800, 1, 1), //黄拖把
Array(1442022, 800, 1, 1), //白拖把
Array(1442023, 800, 1, 1), //黑拖把
Array(1432132, 600, 1, 1), //木精灵枪
Array(1372033, 600, 1, 1), //圣贤短杖
Array(1302017, 800, 1, 1), //蓝色雨伞	
Array(1302016, 800, 1, 1), //黄色雨伞
Array(1302025, 600, 1, 1), //红雨伞
Array(1302026, 300, 1, 1), //黑雨伞
Array(1302027, 800, 1, 1), //绿雨伞
Array(1302028, 800, 1, 1), //紫雨伞
Array(1302029, 800, 1, 1), //褐雨伞
Array(1302058, 500, 1, 1), //冒险岛伞
Array(1442026, 200, 1, 1), //红色冲浪板
Array(1442027, 300, 1, 1), //绿色冲浪板
Array(1442028, 500, 1, 1), //蓝色冲浪板
Array(1442029, 500, 1, 1), //紫色冲浪板
Array(1442011, 500, 1, 1), //冲浪板
Array(1442065, 300, 1, 1), //蓝色冲浪板
Array(1442066, 300, 1, 1), //红色冲浪板.
Array(1442030, 300, 1, 1), //枫之雪板
Array(1442046, 200, 1, 1), //超级滑雪板
Array(1442017, 1000, 1, 1), //赤血雪板
Array(1432017, 200, 1, 1), //绿色滑雪板	
Array(1432018, 300, 1, 1), //蓝色滑雪板	
Array(1432015, 500, 1, 1), //红色滑雪板
Array(1432016, 400, 1, 1) //橙色滑雪板			
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r快乐百宝箱可以获得以下物品，99%获得\r\n\#b是否消耗一张#v5220000#？#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
		if (cm.getInventory(1).isFull(0)){//判断第一个也就是装备栏的装备栏是否有一个空格
		cm.sendOk("#b请保证装备栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
		} else if (cm.getInventory(2).isFull(0)){//判断第二个也就是消耗栏的装备栏是否有一个空格
		cm.sendOk("#b请保证消耗栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
		} else if (cm.getInventory(3).isFull(0)){//判断第三个也就是设置栏的装备栏是否有一个空格
		cm.sendOk("#b请保证设置栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
		} else if (cm.getInventory(4).isFull(0)){//判断第四个也就是其它栏的装备栏是否有一个空格
		cm.sendOk("#b请保证其它栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
		} else if (cm.getInventory(5).isFull(0)){//判断第五个也就是现金栏的装备栏是否有一个空格
		cm.sendOk("#b请保证现金栏位至少有1个空格,否则无法抽奖.");
		cm.dispose();
        } else if(cm.getcz() >= 10){//判断积分
            cm.sendYesNo("  #v4000425##v3994077##v3994079##v3994076##v3994074##v3994076##v3994067##v3994077##v3994063##v4000425#\r\n#b          物品全随机 好坏全看脸 抽奖请慎重 \r\n#r                     确认抽取?"+selStr);
        } else {
            cm.sendOk("  #v4000425##v3994077##v3994079##v3994076##v3994074##v3994076##v3994067##v3994077##v3994063##v4000425#\r\n#b          物品全随机 好坏全看脸 抽奖请慎重 \r\n#r                     确认抽取?"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
		var ii = MapleItemInformationProvider.getInstance();
        var chance = Math.floor(Math.random()*800);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
           //var notice = finalitem[finalchance][3];
           // item = cm.gainGachaponItem(itemId, quantity,);//, notice
			var Laba = finalitem[finalchance][3];
			       
				   
				   if(ii.getInventoryType(itemId).getType() == 1){
			        	var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
						MapleInventoryManipulator.addFromDrop(cm.getC(),toDrop,false);
				}else{
				 	 var toDrop = new Equip(itemId,0).copy();
				cm.gainItem(itemId,quantity);
				}
				
            if (Laba == 1) {
			
			 cm.itemlaba(" 【积分抽奖】获得，大家一起恭喜他/她吧!",toDrop)
                cm.gaincz(-10);	//扣除积分
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {//不喇叭
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.gaincz(-10);	//扣除积分
            cm.safeDispose();
        }
    }
}