/* ==================
 ½Å±¾ÀàÐÍ:  NPC	    
 ½Å±¾×÷Õß£ºÔÂÁÁ     
 ÁªÏµ·½Ê½£º2412614144
 =====================
 */
var ºìÉ«¼ýÍ· = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2# ";

importPackage(net.sf.Start.client);
var status = 0;
var zones = 0;
var ItemId = Array(
        //ÎïÆ·1         ÎïÆ·2    »õ±Ò    ÊýÁ¿
	Array(1302081,4031456,200, "0"),
    Array(1402046,4031456,200, "1"),//ÓÀºãÐþÚ¤½£
	Array(1432047,4031456,200, "2"),//ÓÀºãÏÔÊ¥Ç¹
	Array(1442063,4031456,200, "3"),//ÓÀºãÉñ¹âêª
	Array(1412033,4031456,200, "4"),//ÓÀºãËéö½¸«
    Array(1332073,4031456,200, "4"),//ÓÀºã¿ñöè¾â
    Array(1452057,4031456,200, "5"),//ÓÀºã¾ªµç¹­
	Array(1462050,4031456,200, "6"),//ÓÀºãÓÀºãÚ¤À×åó
	Array(1472068,4031456,200, "7"),//ÓÀºã´ó±¯¸³
    Array(1332073,4031456,200, "8"),//ÓÀºã¶ÏÊ×ÈÐ
    Array(1372044,4031456,200, "9"),//ÓÀºãµûÒíÕÈ
    Array(1382057,4031456,200, "10"),//ÓÀºã±ùÂÖÕÈ
	Array(1482023,4031456,200, "11"),//ÓÀºã¿×È¸ôá
	Array(1492023,4031456,200, "12"),//ÓÀºã·ï»Ëï¥
    Array(1002776,4031456,200, "13"),//ÓÀºã¹Ú¾ü¿ø
    Array(1002777,4031456,200, "14"),//ÓÀºãÐþÃîÃ±
    Array(1002778,4031456,200, "15"),//ÓÀºãÄÞôáÃ±
	Array(1002779,4031456,200, "16"),//ÓÀºãÃÔ×ÙÃ±
	Array(1002780,4031456,200, "17"),//ÓÀºãº£ÍõÐÇ
    Array(1082238,4031456,200, "18"),//ÓÀºã¸§ÀËÊÖÌ×
    Array(1082237,4031456,200, "19"),//ÓÀºãÌ½ÔÆÊÖÌ×
    Array(1082236,4031456,200, "20"),//ÓÀºã°×ÔÆÊÖÌ×
	Array(1082235,4031456,200, "21"),//ÓÀºãåÐÒ£ÊÖÌ×
	Array(1082234,4031456,200, "22"),//ÓÀºã¶¨±ßÊÖÌ×
    Array(1072359,4031456,200, "23"),//ÓÀºã¶¨º£Ñ¥
    Array(1072358,4031456,200, "24"),//ÓÀºãÎè¿ÕÑ¥
    Array(1072357,4031456,200, "25"),//ÓÀºã²ÊºçÐ¬
	Array(1072356,4031456,200, "26"),//ÓÀºãçÎç¿Ð¬
	Array(1072355,4031456,200, "27"),//ÓÀºã¼á±ÚÑ¥
    Array(1052155,4031456,200, "28"),//ÓÀºãÑÝÎäîø
    Array(1052156,4031456,200, "29"),//ÓÀºã°ÂÉñÅÛ
    Array(1052157,4031456,200, "30"),//ÓÀºãÑ²ÀñÕß
	Array(1052158,4031456,200, "31"),//ÓÀºã·­ÔÆ·þ
	Array(1052159,4031456,200, "32")//ÓÀºã°ÔÆßº£
        //ÈçÐèÆäËüµÀ¾ß¶Ò»»£¬Çë°´ÕÕ´Ë¸ñÊ½×ÔÐÐÌíÖÃ¡£
        //´úÂë,¼Û¸ñ,½éÉÜ
        );


function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (status >= 0 && mode == 0) {
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;
        if (status == 0) {
            sl = cm.getPlayer().getItemQuantity(4031456, false);
            StringS = "#b#n   ½ÇÉ«Ê£Óà:" + sl + " ¿Å#v4031456#";
            for (var i = 0; i < ItemId.length; i++) {
                StringS += "\r\n#L" + i + "##b" + ºìÉ«¼ýÍ· + "#b#v " + ItemId[i][1] + " #" + ItemId[i][2] + "#n¿Å#k ¶Ò»» #r#v" + ItemId[i][0] + "##z" + ItemId[i][0] + "##k#l";
            }
            cm.sendSimple(StringS, 2);
            zones == 0;

        } else if (status == 1) {
            if (zones == 0) {
                    if (cm.getInventory(1).isFull()){
                        cm.sendOk("#bÇë±£Ö¤×°±¸À¸Î»ÖÁÉÙÓÐ2¸ö¿Õ¸ñ,·ñÔòÎÞ·¨¹ºÂò.");
                        cm.dispose();
                    } else if (cm.getInventory(2).isFull()){
                        cm.sendOk("#bÇë±£Ö¤ÏûºÄÀ¸Î»ÖÁÉÙÓÐ2¸ö¿Õ¸ñ,·ñÔòÎÞ·¨¹ºÂò.");
                        cm.dispose();
                    } else if (cm.getInventory(3).isFull()){
                        cm.sendOk("#bÇë±£Ö¤ÉèÖÃÀ¸Î»ÖÁÉÙÓÐ2¸ö¿Õ¸ñ,·ñÔòÎÞ·¨¹ºÂò.");
                        cm.dispose();
                    } else if (cm.getInventory(4).isFull()){
                        cm.sendOk("#bÇë±£Ö¤ÆäËûÀ¸Î»ÖÁÉÙÓÐ2¸ö¿Õ¸ñ,·ñÔòÎÞ·¨¹ºÂò.");
                        cm.dispose();
                } else if (cm.haveItem(ItemId[selection][1], ItemId[selection][2])) {
                    cm.gainItem(ItemId[selection][1], -ItemId[selection][2]);
                    cm.gainItem(ItemId[selection][0], 1);
                    cm.sendOk("¶Ò»»³É¹¦£¬Çë¼ì±³°ü!"); 
                    cm.dispose();
                } else {
                    cm.sendOk("#v4031456#²»×ã£¡");
                    cm.dispose();
                }
            }
        }
    }
}	